---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRoughness
source: html/a337ddf1-9783-a5c6-7fc5-c0a16b00d490.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRoughness Property

The property labeled "Roughness" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.